//《数据结构（C++版）（第3版）》 作者：叶核亚
//【例1.3】 随机数序列。

#include "Array.h"
 
int main() 
{
    const int N=10, SIZE=100;
    int value[N]={0};
    random(value,N,SIZE);
    cout<<"随机数序列：";
    print(value, N);

/*    //习题1
    randomDifferent(value,N,SIZE);
    cout<<"互异的随机数序列：";
    print(value, N);
    int key=50;
    cout<<"顺序查找 "<<key<<", "<<((index(value, N, key)==-1)?"不":"")<<"成功\n";

    cout<<"排序随机数序列："<<endl;
    randomSorted(value, N, SIZE);
    cout<<"顺序查找 "<<key<<", "<<((indexSorted(value, N, key)==-1)?"不":"")<<"成功\n";
    key=value[N/2];
    cout<<"顺序查找 "<<key<<", "<<((indexSorted(value, N, key)==-1)?"不":"")<<"成功\n";

    cout<<"最大值: "<<max(value, N)<<"\n";
    int maxValue;
    if (max(value, N, maxValue))
        cout<<"最大值: "<<maxValue<<"\n";*/

    system("pause");
    return 0;
}

/* 
程序运行结果如下：
随机数序列：41  67  34  0  69  24  78  58  62  64  5  45  
重复：78 58 
互异的随机数序列：81  27  61  91  95  42  36  4  2  53  92  82  
顺序查找 50, 不成功
排序随机数序列：
插入21, 	21  
插入16, 	16  21  
插入18, 	16  18  21  
插入95, 	16  18  21  95  
插入47, 	16  18  21  47  95  
插入26, 	16  18  21  26  47  95  
插入71, 	16  18  21  26  47  71  95  
插入38, 	16  18  21  26  38  47  71  95  
插入69, 	16  18  21  26  38  47  69  71  95  
插入12, 	12  16  18  21  26  38  47  69  71  95  
插入67, 	12  16  18  21  26  38  47  67  69  71  95  
插入99, 	12  16  18  21  26  38  47  67  69  71  95  99  
12? 16? 18? 21? 26? 38? 顺序查找 38, 成功
最大值: 99
最大值: 99



随机数序列：1  7  14  0  9  4  18  18  2  4  5  5  1  7  1  11  15  2  7  16  
重复：4 5 5 1 1 7 11 11 11 11 11 11 11 11 15 15 15 2 2 2 2 2 2 2 2 7 7 7 16 16 16 16 
互异的随机数序列：11  4  2  13  12  1  16  18  15  7  6  9  19  14  3  8  17  10  0  5  
顺序查找 50, 不成功
插入排序随机数序列：
插入10, 	10  
插入9, 	9  10  
插入10, 	9  10  10  
插入10, 	9  10  10  10  
插入6, 	6  9  10  10  10  
插入1, 	1  6  9  10  10  10  
插入13, 	1  6  9  10  10  10  13  
插入8, 	1  6  8  9  10  10  10  13  
插入9, 	1  6  8  9  9  10  10  10  13  
插入3, 	1  3  6  8  9  9  10  10  10  13  
最大值: 19
最大值: 19

*/


